@echo off

:: ************************************************************
:: ↓↓ ここから変更する箇所
:: ↓↓ ※ = の前後に空白は入れないでください
:: ************************************************************

set img_from=
set img_to=
set from_tag=
set to_tag=

:: ************************************************************
:: ↑↑ ここまで変更する箇所
:: ************************************************************



:: ************************************************************
:: 以降は変更する必要なし
:: ************************************************************

if "%img_from%"=="" (
  start notepad .\flip2.bat
  goto eof
)

:: ファイル名に振られているタグを指定しなかった場合はファイル名を変更しない
if "%from_tag%"=="" (
  :from_tag
  java -jar flip_image.jar -f %img_from% -t %img_to%
  goto eof
)

if "%to_tag%"=="" (
  goto from_tag
)

java -jar flip_image.jar -f %img_from% -t %img_to% -ft !from_tag! -tt !to_tag!

:eof
